MPAP01  DFHMSD TYPE=MAP,STORAGE=AUTO,LANG=COBOL,TIOAPFX=YES,TERM=3270, X
               CTRL=FREEKB,MODE=INOUT                                   
SCRN1   DFHMDI SIZE=(24,80),LINE=1,COLUMN=1,MAPATTS=COLOR               
        DFHMDF POS=(1,1),                                              X
               LENGTH=79,                                              X
               ATTRB=PROT,                                             X
               COLOR=BLUE,                                             X
               INITIAL='===============================================X
               ================================'                        
        DFHMDF POS=(2,27),                                             X
               LENGTH=26,                                              X
               ATTRB=PROT,                                             X
               COLOR=BLUE,                                             X
               INITIAL='AIRLINE RESERVATION SYSTEM'                     
        DFHMDF POS=(3,32),                                             X
               LENGTH=15,                                              X
               ATTRB=PROT,                                             X
               COLOR=BLUE,                                             X
               INITIAL='AIRPORT INQUIRY'                                
        DFHMDF POS=(4,1),                                              X
               LENGTH=79,                                              X
               ATTRB=PROT,                                             X
               COLOR=BLUE,                                             X
               INITIAL='===============================================X
               ================================'                        
        DFHMDF POS=(6,5),                                              X
               LENGTH=11,                                              X
               ATTRB=PROT,                                             X
               COLOR=GREEN,                                            X
               INITIAL='AIRPORT ID:'                                    
        DFHMDF POS=(9,5),                                              X
               LENGTH=13,                                              X
               ATTRB=PROT,                                             X
               COLOR=GREEN,                                            X
               INITIAL='AIRPORT CODE:'                                  
AP01CD  DFHMDF POS=(9,19),                                             X
               LENGTH=4,                                               X
               ATTRB=PROT,                                             X
               COLOR=GREEN                                              
AP01ID  DFHMDF POS=(6,17),                                             X
               LENGTH=10,                                              X
               ATTRB=(UNPROT,NUM,IC,FSET),                             X
               COLOR=GREEN                                              
        DFHMDF POS=(11,5),                                             X
               LENGTH=13,                                              X
               ATTRB=PROT,                                             X
               COLOR=GREEN,                                            X
               INITIAL='AIRPORT NAME:'                                  
AP01NA  DFHMDF POS=(11,19),                                            X
               LENGTH=40,                                              X
               ATTRB=PROT,                                             X
               COLOR=GREEN                                              
        DFHMDF POS=(13,5),                                             X
               LENGTH=5,                                               X
               ATTRB=PROT,                                             X
               COLOR=GREEN,                                            X
               INITIAL='CITY:'                                          
AP01CY  DFHMDF POS=(13,11),                                            X
               LENGTH=50,                                              X
               ATTRB=PROT,                                             X
               COLOR=GREEN                                              
        DFHMDF POS=(15,5),                                             X
               LENGTH=8,                                               X
               ATTRB=PROT,                                             X
               COLOR=GREEN,                                            X
               INITIAL='COUNTRY:'                                       
AP01CR  DFHMDF POS=(15,14),                                            X
               LENGTH=50,                                              X
               ATTRB=PROT,                                             X
               COLOR=GREEN                                              
        DFHMDF POS=(21,1),                                             X
               LENGTH=79,                                              X
               ATTRB=PROT,                                             X
               COLOR=BLUE,                                             X
               INITIAL='===============================================X
               ================================'                        
        DFHMDF POS=(22,7),                                             X
               LENGTH=14,                                              X
               ATTRB=PROT,                                             X
               COLOR=BLUE,                                             X
               INITIAL='ENTER - SEARCH'                                 
        DFHMDF POS=(24,1),                                             X
               LENGTH=79,                                              X
               ATTRB=PROT,                                             X
               COLOR=BLUE,                                             X
               INITIAL='===============================================X
               ================================'                        
        DFHMDF POS=(22,25),                                            X
               LENGTH=12,                                              X
               ATTRB=PROT,                                             X
               COLOR=BLUE,                                             X
               INITIAL='PF3 - RETURN'                                   
        DFHMDF POS=(23,7),                                             X
               LENGTH=8,                                               X
               ATTRB=PROT,                                             X
               COLOR=BLUE,                                             X
               INITIAL='MESSAGE:'                                       
APMSG   DFHMDF POS=(23,16),                                            X
               LENGTH=40,                                              X
               ATTRB=PROT,                                             X
               COLOR=BLUE                                               
        DFHMSD TYPE=FINAL                                               