MPAT00  DFHMSD TYPE=MAP,STORAGE=AUTO,LANG=COBOL,TIOAPFX=YES,TERM=3270, X
               CTRL=FREEKB,MODE=INOUT                                   
SCRN1   DFHMDI SIZE=(24,80),LINE=1,COLUMN=1,MAPATTS=COLOR               
        DFHMDF POS=(1,1),                                              X
               LENGTH=79,                                              X
               ATTRB=PROT,                                             X
               COLOR=BLUE,                                             X
               INITIAL='===============================================X
               ================================'                        
        DFHMDF POS=(2,27),                                             X
               LENGTH=26,                                              X
               ATTRB=PROT,                                             X
               COLOR=BLUE,                                             X
               INITIAL='AIRLINE RESERVATION SYSTEM'                     
        DFHMDF POS=(3,33),                                             X
               LENGTH=13,                                              X
               ATTRB=PROT,                                             X
               COLOR=BLUE,                                             X
               INITIAL='AIRCRAFT MENU'                                  
        DFHMDF POS=(4,1),                                              X
               LENGTH=79,                                              X
               ATTRB=PROT,                                             X
               COLOR=BLUE,                                             X
               INITIAL='===============================================X
               ================================'                        
        DFHMDF POS=(7,30),                                             X
               LENGTH=19,                                              X
               ATTRB=PROT,                                             X
               COLOR=GREEN,                                            X
               INITIAL='1. AIRCRAFT INQUIRY'                            
        DFHMDF POS=(8,30),                                             X
               LENGTH=18,                                              X
               ATTRB=PROT,                                             X
               COLOR=GREEN,                                            X
               INITIAL='2. AIRCRAFT CREATE'                             
        DFHMDF POS=(11,30),                                            X
               LENGTH=7,                                               X
               ATTRB=PROT,                                             X
               COLOR=GREEN,                                            X
               INITIAL='OPTION:'                                        
AT00OP  DFHMDF POS=(11,38),                                            X
               LENGTH=2,                                               X
               ATTRB=(UNPROT,NUM,IC,FSET),                             X
               COLOR=GREEN                                              
        DFHMDF POS=(21,1),                                             X
               LENGTH=79,                                              X
               ATTRB=PROT,                                             X
               COLOR=BLUE,                                             X
               INITIAL='===============================================X
               ================================'                        
        DFHMDF POS=(22,7),                                             X
               LENGTH=16,                                              X
               ATTRB=PROT,                                             X
               COLOR=BLUE,                                             X
               INITIAL='ENTER - CONTINUE'                               
        DFHMDF POS=(24,1),                                             X
               LENGTH=79,                                              X
               ATTRB=PROT,                                             X
               COLOR=BLUE,                                             X
               INITIAL='===============================================X
               ================================'                        
        DFHMDF POS=(23,7),                                             X
               LENGTH=8,                                               X
               ATTRB=PROT,                                             X
               COLOR=BLUE,                                             X
               INITIAL='MESSAGE:'                                       
APMSG   DFHMDF POS=(23,16),                                            X
               LENGTH=40,                                              X
               ATTRB=PROT,                                             X
               COLOR=BLUE                                               
        DFHMDF POS=(22,25),                                            X
               LENGTH=12,                                              X
               ATTRB=PROT,                                             X
               COLOR=BLUE,                                             X
               INITIAL='PF3 - RETURN'                                   
        DFHMSD TYPE=FINAL                                               