MPFT02  DFHMSD TYPE=MAP,STORAGE=AUTO,LANG=COBOL,TIOAPFX=YES,TERM=3270, X
               CTRL=FREEKB,MODE=INOUT                                   
SCRN1   DFHMDI SIZE=(24,80),LINE=1,COLUMN=1,MAPATTS=COLOR               
        DFHMDF POS=(1,1),                                              X
               LENGTH=79,                                              X
               ATTRB=PROT,                                             X
               COLOR=BLUE,                                             X
               INITIAL='===============================================X
               ================================'                        
        DFHMDF POS=(2,27),                                             X
               LENGTH=26,                                              X
               ATTRB=PROT,                                             X
               COLOR=BLUE,                                             X
               INITIAL='AIRLINE RESERVATION SYSTEM'                     
        DFHMDF POS=(3,33),                                             X
               LENGTH=13,                                              X
               ATTRB=PROT,                                             X
               COLOR=BLUE,                                             X
               INITIAL='FLIGHT CREATE'                                  
        DFHMDF POS=(4,1),                                              X
               LENGTH=79,                                              X
               ATTRB=PROT,                                             X
               COLOR=BLUE,                                             X
               INITIAL='===============================================X
               ================================'                        
        DFHMDF POS=(9,3),                                              X
               LENGTH=12,                                              X
               ATTRB=PROT,                                             X
               COLOR=GREEN,                                            X
               INITIAL='AIRCRAFT ID:'                                   
FT01AI  DFHMDF POS=(9,16),                                             X
               LENGTH=9,                                               X
               ATTRB=(UNPROT,NUM,IC,FSET),                             X
               COLOR=NEUTRAL                                            
        DFHMDF POS=(9,28),                                             X
               LENGTH=7,                                               X
               ATTRB=PROT,                                             X
               COLOR=GREEN,                                            X
               INITIAL='STATUS:'                                        
FT01ST  DFHMDF POS=(9,36),                                             X
               LENGTH=8,                                               X
               ATTRB=(UNPROT,FSET),                                    X
               COLOR=NEUTRAL                                            
        DFHMDF POS=(11,3),                                             X
               LENGTH=7,                                               X
               ATTRB=PROT,                                             X
               COLOR=GREEN,                                            X
               INITIAL='ORIGIN:'                                        
FT01OR  DFHMDF POS=(11,11),                                            X
               LENGTH=3,                                               X
               ATTRB=(UNPROT,FSET),                                    X
               COLOR=NEUTRAL                                            
        DFHMDF POS=(11,16),                                            X
               LENGTH=12,                                              X
               ATTRB=PROT,                                             X
               COLOR=GREEN,                                            X
               INITIAL='DESTINATION:'                                   
FT01DE  DFHMDF POS=(11,29),                                            X
               LENGTH=3,                                               X
               ATTRB=(UNPROT,FSET),                                    X
               COLOR=NEUTRAL                                            
        DFHMDF POS=(13,3),                                             X
               LENGTH=28,                                              X
               ATTRB=PROT,                                             X
               COLOR=GREEN,                                            X
               INITIAL='DEPARTURE DATE (YYYY-MM-DD):'                   
FT01DD  DFHMDF POS=(13,32),                                            X
               LENGTH=10,                                              X
               ATTRB=(UNPROT,FSET),                                    X
               COLOR=NEUTRAL                                            
        DFHMDF POS=(13,44),                                            X
               LENGTH=23,                                              X
               ATTRB=PROT,                                             X
               COLOR=GREEN,                                            X
               INITIAL='DEPARTURE TIME (HH.MM):'                        
FT01DT  DFHMDF POS=(13,68),                                            X
               LENGTH=5,                                               X
               ATTRB=(UNPROT,FSET),                                    X
               COLOR=NEUTRAL                                            
        DFHMDF POS=(15,3),                                             X
               LENGTH=26,                                              X
               ATTRB=PROT,                                             X
               COLOR=GREEN,                                            X
               INITIAL='ARRIVAL DATE (YYYY-MM-DD):'                     
FT01AD  DFHMDF POS=(15,30),                                            X
               LENGTH=10,                                              X
               ATTRB=(UNPROT,FSET),                                    X
               COLOR=NEUTRAL                                            
        DFHMDF POS=(15,44),                                            X
               LENGTH=21,                                              X
               ATTRB=PROT,                                             X
               COLOR=GREEN,                                            X
               INITIAL='ARRIVAL TIME (HH.MM):'                          
FT01AT  DFHMDF POS=(15,66),                                            X
               LENGTH=5,                                               X
               ATTRB=(UNPROT,FSET),                                    X
               COLOR=NEUTRAL                                            
        DFHMDF POS=(21,1),                                             X
               LENGTH=79,                                              X
               ATTRB=PROT,                                             X
               COLOR=BLUE,                                             X
               INITIAL='===============================================X
               ================================'                        
        DFHMDF POS=(22,10),                                            X
               LENGTH=14,                                              X
               ATTRB=PROT,                                             X
               COLOR=BLUE,                                             X
               INITIAL='ENTER - CREATE'                                 
        DFHMDF POS=(22,27),                                            X
               LENGTH=12,                                              X
               ATTRB=PROT,                                             X
               COLOR=BLUE,                                             X
               INITIAL='PF3 - RETURN'                                   
        DFHMDF POS=(23,10),                                            X
               LENGTH=8,                                               X
               ATTRB=PROT,                                             X
               COLOR=BLUE,                                             X
               INITIAL='MESSAGE:'                                       
FTMSG   DFHMDF POS=(23,19),                                            X
               LENGTH=40,                                              X
               ATTRB=PROT,                                             X
               COLOR=BLUE                                               
        DFHMDF POS=(24,1),                                             X
               LENGTH=79,                                              X
               ATTRB=PROT,                                             X
               COLOR=BLUE,                                             X
               INITIAL='===============================================X
               ================================'                        
        DFHMSD TYPE=FINAL                                               